[
  {
    "name": "봉골레파스타",
    "time": "10분",
    "category": "양식",
    "material": "스파게티 200g 바지락 또는 모시조개 500g 올리브유 3큰술 마늘 4쪽 (얇게 썬다) 화이트 와인 100ml 체리 토마토 10개 (반으로 자른다, 선택사항) 페퍼론치노 1-2개 (씨를 제거하고 잘게 썬다, 선택사항) 신선한 파슬리 약간 (다진다) 소금, 후추 약간 레몬 1/2개 (즙을 짠다) 물 1컵 버터 1큰술 (선택사항",
    "recipe": "재료 준비:  조개는 깨끗이 씻어 소금물에 담가 두어 해감을 한다. 마늘은 얇게 썬다. 파슬리는 다진다. 파스타 삶기:  큰 냄비에 물을 끓이고 소금을 넣은 다음 스파게티를 넣어 알 덴테(약간 덜 익게)로 삶는다. (약 1-2분 덜 익히기) 삶은 후 체에 밭쳐 물기를 뺀다. (파스타 삶은 물은 따로 보관한다) 조개 준비:  큰 팬에 올리브유를 두르고 중간 불에서 마늘을 볶는다. 마늘이 노릇노릇해지면 페퍼론치노를 넣고 잠시 볶는다. (페퍼론치노는 매운 맛을 원할 경우 선택사항입니다) 조개를 팬에 넣고 화이트 와인을 부어준다. 뚜껑을 덮고 약 3-5분간 조개가 입을 벌릴 때까지 익힌다. 파스타와 조개 합치기:  조개가 익으면 반으로 자른 체리 토마토를 팬에 추가한다. (선택사항) 삶은 파스타를 팬에 넣고 조개에서 나온 국물과 섞어준다. 필요시 파스타 삶은 물을 조금씩 추가하여 소스의 농도를 조절한다. 소금과 후추로 간을 맞춘다. 버터를 넣어 풍미를 더할 수 있다. (선택사항) 마무리:  다진 파슬리를 뿌리고, 레몬즙을 살짝 뿌려준다. 잘 섞어 접시에 담는다",
    "image": "pastaBolognese.png",
    "userId": "소연",
    "nutrition": null,
    "likes": 11
  },
  {
    "name": "미역국",
    "time": "15분",
    "category": "한식",
    "material": "재료 말린 미역: 20g 소고기: 100g (양지머리나 사태) 참기름: 1큰술 마늘: 2쪽 (다진 마늘) 국간장: 2큰술 소금: 적당량 물: 1.5리터",
    "recipe": "미역 불리기: 말린 미역을 물에 10-15분 정도 불려주세요. 불린 미역은 물기를 짜서 먹기 좋은 크기로 잘라둡니다.  소고기 준비: 소고기는 얇게 썰어 준비합니다. 핏물을 제거하기 위해 찬물에 잠시 담가 두었다가 꺼내어 물기를 제거합니다.  소고기 볶기: 냄비에 참기름을 두르고 다진 마늘과 소고기를 넣어 볶습니다. 소고기가 익을 때까지 볶아줍니다.  미역 넣기: 볶은 소고기에 불린 미역을 넣고 함께 볶아줍니다. 이때 국간장 2큰술을 넣어 함께 볶아줍니다.  물 붓기: 재료들이 잘 어우러지면 물 1.5리터를 부어 끓입니다. 끓기 시작하면 불을 약하게 줄이고 20-30분 정도 끓여줍니다.  간 맞추기: 국이 충분히 끓으면 소금으로 간을 맞춥니다. 필요에 따라 국간장을 더 추가할 수도 있습니다.",
    "image": "seaweedSoup.png",
    "userId": "민혁",
    "nutrition": {
      "calories": "318.00",
      "carbohydrate": "1.10",
      "protein": "9.40",
      "fat": "3.60",
      "sugars": "N/A",
      "sodium": "6516.00",
      "cholesterol": "N/A",
      "saturatedFat": "N/A",
      "transFat": "N/A"
    },
    "likes": 2
  },
  {
    "name": "두부김치",
    "time": "15분",
    "category": "한식",
    "material": "두부: 1모 잘 익은 김치: 300g 돼지고기: 150g (목살이나 삼겹살) 양파: 1/2개 대파: 1대 다진 마늘: 1큰술 고춧가루: 1큰술 간장: 1큰술 설탕: 1큰술 참기름: 1큰술 소금: 적당량 식용유: 1큰술 통깨: 약간",
    "recipe": "재료 준비:  두부는 끓는 물에 소금을 약간 넣고 5분 정도 데친 후 물기를 빼고 먹기 좋은 크기로 썰어줍니다. 김치는 적당한 크기로 썰어줍니다. 돼지고기는 먹기 좋은 크기로 썰고, 양파는 채썰고, 대파는 어슷썰기합니다. 돼지고기 볶기:  중불로 달군 팬에 식용유를 두르고 다진 마늘을 볶아 향을 내줍니다. 돼지고기를 넣고 볶다가 고기가 반쯤 익으면 양파를 넣고 함께 볶습니다. 김치 볶기:  돼지고기가 거의 익었을 때 김치를 넣고 함께 볶아줍니다. 고춧가루, 간장, 설탕을 넣고 김치가 부드러워질 때까지 볶습니다. 마지막으로 대파를 넣고 살짝 볶아줍니다. 참기름을 두르고 한 번 더 섞어줍니다. 두부 준비:  데친 두부를 접시에 담고, 위에 볶은 김치와 돼지고기를 올려줍니다. 통깨를 뿌려 마무리합니다. 완성:  두부김치를 접시에 예쁘게 담아 맛있게 드세요",
    "image": "tofuKimchi.png",
    "userId": "용호",
    "nutrition": {
      "calories": "288.21",
      "carbohydrate": "14.08",
      "protein": "19.47",
      "fat": "17.11",
      "sugars": "1.49",
      "sodium": "989.69",
      "cholesterol": "13.92",
      "saturatedFat": "3.17",
      "transFat": "0.07"
    },"updatedAt" : 20250626

  }
]